{
    "Apple__Apple_scab": "Apple scab is a disease caused by the fungus Venturia inaequalis. It affects the leaves and fruit of apple trees, causing dark, scabby lesions.",
    "Apple_Black_rot": "Black rot of apple is caused by the fungus Botryosphaeria obtusa. It leads to fruit rot, leaf spot, and canker diseases in apple trees.",
    "Apple_Cedar_apple_rust": "Cedar-apple rust is a disease caused by the fungus Gymnosporangium juniperi-virginianae. It affects apple trees and cedar trees alternately.",
    "Apple_healthy": "The apple tree is healthy with no visible signs of disease.",
    "Blueberry_healthy": "The blueberry plant is healthy with no visible signs of disease.",
    "Cherry(including_sour)__Powdery_mildew": "Powdery mildew on cherry is caused by the fungus Podosphaera clandestina. It appears as a white powdery growth on leaves and shoots.",
    "Cherry(including_sour)__healthy": "The cherry plant is healthy with no visible signs of disease.",
    "Corn(maize)__Cercospora_leaf_spot Gray_leaf_spot": "Gray leaf spot of maize is caused by the fungus Cercospora zeae-maydis. It causes gray, rectangular lesions on leaves.",
    "Corn(maize)__Common_rust": "Common rust of maize is caused by the fungus Puccinia sorghi. It produces reddish-brown pustules on leaves.",
    "Corn_(maize)__Northern_Leaf_Blight": "Northern leaf blight of maize is caused by the fungus Exserohilum turcicum. It creates long, elliptical gray-green lesions on leaves.",
    "Corn(maize)__healthy": "The maize plant is healthy with no visible signs of disease.",
    "Grape_Black_rot": "Black rot of grape is caused by the fungus Guignardia bidwellii. It results in black lesions on leaves and fruit.",
    "Grape_Esca(Black_Measles)": "Esca (Black Measles) of grape is a complex disease caused by several fungi. It causes leaf striping and black lesions on berries.",
    "Grape__Leaf_blight(Isariopsis_Leaf_Spot)": "Leaf blight of grape is caused by the fungus Pseudopezicula tracheiphila. It leads to brown lesions on leaves.",
    "Grape__healthy": "The grapevine is healthy with no visible signs of disease.",
    "Orange_Haunglongbing(Citrus_greening)": "Huanglongbing, also known as citrus greening, is caused by the bacterium Candidatus Liberibacter asiaticus. It results in yellowing leaves and misshapen fruit.",
    "Peach__Bacterial_spot": "Bacterial spot of peach is caused by the bacterium Xanthomonas campestris pv. pruni. It results in water-soaked spots on leaves and fruit.",
    "Peach_healthy": "The peach tree is healthy with no visible signs of disease.",
    "Pepper,_bell_Bacterial_spot": "Bacterial spot of bell pepper is caused by Xanthomonas campestris pv. vesicatoria. It results in water-soaked lesions on leaves and fruit.",
    "Pepper,_bell_healthy": "The bell pepper plant is healthy with no visible signs of disease.",
    "Potato_Early_blight": "Early blight of potato is caused by the fungus Alternaria solani. It causes dark, concentric lesions on leaves.",
    "Potato_Late_blight": "Late blight of potato is caused by the oomycete Phytophthora infestans. It results in water-soaked lesions that turn brown and necrotic.",
    "Potato_healthy": "The potato plant is healthy with no visible signs of disease.",
    "Raspberry_healthy": "The raspberry plant is healthy with no visible signs of disease.",
    "Soybean_healthy": "The soybean plant is healthy with no visible signs of disease.",
    "Squash_Powdery_mildew": "Powdery mildew of squash is caused by several fungi, including Erysiphe cichoracearum. It appears as white powdery spots on leaves.",
    "Strawberry_Leaf_scorch": "Leaf scorch of strawberry is caused by the fungus Diplocarpon earlianum. It results in irregular, dark brown spots on leaves.",
    "Strawberry_healthy": "The strawberry plant is healthy with no visible signs of disease.",
    "Tomato_Bacterial_spot": "Bacterial spot of tomato is caused by Xanthomonas spp. It results in water-soaked lesions on leaves and fruit.",
    "Tomato_Early_blight": "Early blight of tomato is caused by the fungus Alternaria solani. It creates concentric rings on leaves and fruit.",
    "Tomato_Late_blight": "Late blight of tomato is caused by Phytophthora infestans. It leads to water-soaked, dark lesions on leaves and fruit.",
    "Tomato_Leaf_Mold": "Leaf mold of tomato is caused by the fungus Passalora fulva. It results in yellow spots on leaves that turn brown.",
    "Tomato_Septoria_leaf_spot": "Septoria leaf spot of tomato is caused by Septoria lycopersici. It produces small, circular lesions with dark borders.",
    "Tomato_Spider_mites Two-spotted_spider_mite": "Two-spotted spider mite (Tetranychus urticae) infestation causes stippling and webbing on tomato leaves.",
    "Tomato_Target_Spot": "Target spot of tomato is caused by the fungus Corynespora cassiicola. It leads to brown, target-like spots on leaves.",
    "Tomato_Tomato_Yellow_Leaf_Curl_Virus": "Tomato yellow leaf curl virus (TYLCV) causes yellowing and curling of leaves, and stunted growth in tomato plants.",
    "Tomato_Tomato_mosaic_virus": "Tomato mosaic virus (ToMV) results in mottled, dark green and light green leaves, and reduced fruit yield.",
    "Tomato__healthy": "The tomato plant is healthy with no visible signs of disease."
}
